let pointdata={
    paths:[
        {
            xy: [116.029973,25.893226],
            name:'瑞金',
            ico:'ruijin.jpg',
            info:'江西瑞金是闻名中外的红色故都、共和国摇篮、中央红军长征出发地。1934年10月10日，中央红军从这里出发，开始了伟大的二万五千里长征。'
        },
        {
            xy: [112.942776, 28.050616],
            name: '血战湘江',
            ico:'xiangjiang.jpg',
            info:'湘江战役是中央红军突围以来最壮烈、最关键的一仗，我军与优势之敌苦战，终于撕开了敌重兵设防的封锁线，粉碎了蒋介石围歼红军于湘江以东的企图。 红军虽然突破了第四道封锁线，但付出了巨大的代价。5军团和在长征前夕成立的少共国际师损失过半，8军团损失更为惨重，34师被敌人重重包围，全体指战员浴血奋战，直到弹尽粮绝，绝大部分同志壮烈牺牲。渡过湘江后，中央红军和军委两纵队，已由出发时的8.6万人锐减到3万人。引起了广大干部和战士对王明军事路线的怀疑和不满到达了极点，纷纷要求改换领导。'
       },
        {
            xy: [106.933426, 27.732213],
            name: '遵义会议',
            ico:'zunyi.jpg',
            info:'遵义会议是指1935年1月15日至17日，中共中央政治局在贵州遵义召开的独立自主地解决中国革命问题的一次极其重要的扩大会议。是在红军第五次反“围剿”失败和长征初期严重受挫的情况下，为了纠正博古“左”倾领导在军事指挥上的错误而召开的。这次会议是中国共产党第一次独立自主地运用马克思列宁主义基本原理解决问题的路线、方针政策的会议。这次会议开始确立实际以毛泽东为代表的马克思主义的正确路线在中共中央的领导地位，挽救了党、挽救了红军、挽救了中国革命，是中国共产党历史上一个生死攸关的转折点，标志着中国共产党从幼稚走向成熟。'
        },
        
        {
            xy: [105.72419, 28.595104],
            name: '四渡赤水',
            ico:'chishui.jpg',
            info:'四渡赤水战役是遵义会议之后，中央红军在长征途中，处于国民党几十万重兵围追堵截的艰险条件下，进行的一次决定性运动战战役。在毛泽东主席、周、朱等指挥下，中央红军采取高度机动的运动战方针，纵横驰骋于川黔滇边境广大地区，积极寻找战机，有效地调动和歼灭敌人，彻底粉碎了蒋介石等反动派企图围歼红军于川黔滇边境的狂妄计划，红军取得了战略转移中具有决定意义的胜利。'
        },
        {
            xy: [102.458495, 26.125538],
            name: '巧渡金沙江',
            ico: 'jinshajiang.jpg',
            info: '金沙江位于长江的上游。它穿行在川滇边界的深山狭谷间，江面宽阔，水急浪大。如果红军过不去，就会被敌人压进深山狭谷，遭致全军覆灭的危险。当红军大队人马向金沙江挺进时，蒋介石如梦初醒，认定红军的目的地既不在贵阳，也不在昆明，而是“必渡金沙江无疑”。1935年4月28日，他下达命令，控制渡口，毁船封江。就在红军进抵金沙江前夕，江边的敌人已将所有船只掠到北岸了。'
        },
        {
            xy: [102.389563, 29.24993],
            name: '强渡大渡河',
            ico: 'daduhe.jpg',
            info: '强渡大渡河（Force dadu river）是指1935年5月中国工农红军在四川省越西县（今属四川省石棉县）安顺场渡过大渡河的战斗，也是长征途中的一次著名战斗。中国酒泉卫星发射中心首任司令员孙继先中将，在长征中曾是红一军团红一师红一团一营营长，他亲自挑选并带领十七勇士强渡大渡河，从而在被敌人视为插翅难飞的天险防线上，打开一个缺口，为中央红军北上开辟了一条通道。'
        },
        {
            xy: [102.239875, 29.918205],
            name: '飞夺泸定桥',
            ico: 'ludinqiao.jpg',
            info: '飞夺泸定桥，是中国工农红军长征中的一场战役，发生于1935年5月29日。中央红军部队在四川省中西部强渡大渡河成功，沿大渡河左岸北上，主力由安顺场沿大渡河右岸北上，红四团官兵在天下大雨的情况下，在崎岖陡峭的山路上跑步前进，一昼夜奔袭竟达120公里，终于在5月29日凌晨6时许按时到达泸定桥西岸。第2连连长和22名突击队员沿着枪林弹雨和火墙密布的铁索踩着铁链夺下桥头，并与左岸部队合围占领了泸定桥。'
        },
        {
            xy: [102.765855, 30.729584],
            name: '爬雪山',
            ico: 'xueshan.jpg',
            info: '1934年至1936年，中国工农红军以血肉之躯谱写了人类历史上无与伦比的英雄史诗：二万五千里长征。它那传奇式的牺牲和坚韧不拔的革命英雄主义精神始终是中国革命和建设赖以成功的基础，它激励着一个有14亿人口的中国朝着一个无人能够预言的未来前进。中国工农红军的长征是举世无双的壮举，它像一条永远铭刻在地球上的红飘带，成为人类坚定无畏的象征。'
        },
        {
            xy: [102.645019, 30.968853],
            name: '懋功会师',
            ico: 'huishi.jpg',
            info: '懋功会师是指1935年6月18日，中共中央、中央军委率领一方面红军主力到达懋功，与前来接应的红四方面军会师。红四方面军的西进部队于1935年6月8日攻克懋功。接着，以一部前出至懋功东南的达维乡。6月12日，红一方面军先头部队在北进达维途中，同红4方面军一部胜利会师。18日，中共中央、中革军委和红1方面军主力到达懋功，21日晚，红1方面军和红4方面军的部队举行联欢会，庆祝会师。'
        },
        {
            xy: [103.06148, 32.602827],
            name: '过草地',
            ico: 'caodi.jpg',
            info: '1935年8月21日，红军开始过草地。行军队左右两路，平行前进。右路军由毛泽东、周恩来、徐向前等率领，自四川毛儿盖出发，进入草地。经过7天的艰苦努力，右路军到达草地尽头的班佑地区。左翼为林彪的红1军团，先行；继后是中央领导机关、红军大学学生等。右翼为徐向前、陈昌浩率领的红三十军和红四军。彭德怀率红三军团垫后，走左翼行军路线。'
        }, {
            xy: [103.929266, 34.139361],
            name: '腊子口战役',
            ico: 'lazikou.jpg',
            info: '1935年9月16日，中国工农红军陕甘支队抵达甘肃南部的天险关隘腊子口。国民党军鲁大昌部3个团据险阻击红军前进。当天，红军正面强攻，未能突破国民党军防御阵地。17日，红军两个连翻越悬崖陡壁，穿插国民党军侧背，一举将守敌击溃。天险腊子口突破后，中央红军进入甘南开阔地带，北上陕甘地区的通道开辟出来了。'
        },
        {
            xy: [105.063054, 35.698041],
            name: '大会师',
            ico: 'dahuishi.jpg',
            info: '1936年10月9日和22日，红四、红二方面军先后在甘肃省会宁县城和静宁县将台堡与红一方面军会师，中国工农红军持续两年、转战14个省的长征全部胜利结束。长征突破了数十万国民党军的围追堵截，完成了伟大的战略转移，中国革命和革命战争从此揭开新的篇章。'
        },
        {
            xy: [109.503478, 36.596212],
            name: '延安',
            ico: 'yanan.jpg',
            info: '1935年10月，中央红军经过二万五千里长征，到达西北革命根据地。从此，以毛泽东为代表的党中央在这里战斗和生活了13年。延安和陕甘宁边区成为中国人民抗日战争的领导中心、解放战争的总后方、万众瞩目的革命圣地——西北革命根据地。'
        },

    ],
    war:[
        {
          xy: [112.942776, 28.050616],
          name: '血战湘江',
          ico: 'xiangjiang.jpg',
          info: '湘江战役是中央红军突围以来最壮烈、最关键的一仗，我军与优势之敌苦战，终于撕开了敌重兵设防的封锁线，粉碎了蒋介石围歼红军于湘江以东的企图。 红军虽然突破了第四道封锁线，但付出了巨大的代价。5军团和在长征前夕成立的少共国际师损失过半，8军团损失更为惨重，34师被敌人重重包围，全体指战员浴血奋战，直到弹尽粮绝，绝大部分同志壮烈牺牲。渡过湘江后，中央红军和军委两纵队，已由出发时的8.6万人锐减到3万人。引起了广大干部和战士对王明军事路线的怀疑和不满到达了极点，纷纷要求改换领导。'
        }, {
          xy: [105.72419, 28.595104],
          name: '四渡赤水',
          ico: 'chishui.jpg',
          info: '四渡赤水战役是遵义会议之后，中央红军在长征途中，处于国民党几十万重兵围追堵截的艰险条件下，进行的一次决定性运动战战役。在毛泽东主席、周、朱等指挥下，中央红军采取高度机动的运动战方针，纵横驰骋于川黔滇边境广大地区，积极寻找战机，有效地调动和歼灭敌人，彻底粉碎了蒋介石等反动派企图围歼红军于川黔滇边境的狂妄计划，红军取得了战略转移中具有决定意义的胜利。'
        }, {
          xy: [102.458495, 26.125538],
          name: '巧渡金沙江',
          ico: 'jinshajiang.jpg',
          info: '金沙江位于长江的上游。它穿行在川滇边界的深山狭谷间，江面宽阔，水急浪大。如果红军过不去，就会被敌人压进深山狭谷，遭致全军覆灭的危险。当红军大队人马向金沙江挺进时，蒋介石如梦初醒，认定红军的目的地既不在贵阳，也不在昆明，而是“必渡金沙江无疑”。1935年4月28日，他下达命令，控制渡口，毁船封江。就在红军进抵金沙江前夕，江边的敌人已将所有船只掠到北岸了。'
        }, {
          xy: [102.389563, 29.24993],
          name: '强渡大渡河',
          ico: 'daduhe.jpg',
          info: '强渡大渡河（Force dadu river）是指1935年5月中国工农红军在四川省越西县（今属四川省石棉县）安顺场渡过大渡河的战斗，也是长征途中的一次著名战斗。中国酒泉卫星发射中心首任司令员孙继先中将，在长征中曾是红一军团红一师红一团一营营长，他亲自挑选并带领十七勇士强渡大渡河，从而在被敌人视为插翅难飞的天险防线上，打开一个缺口，为中央红军北上开辟了一条通道。'
        }, {
          xy: [102.239875, 29.918205],
          name: '飞夺泸定桥',
          ico: 'ludinqiao.jpg',
          info: '飞夺泸定桥，是中国工农红军长征中的一场战役，发生于1935年5月29日。中央红军部队在四川省中西部强渡大渡河成功，沿大渡河左岸北上，主力由安顺场沿大渡河右岸北上，红四团官兵在天下大雨的情况下，在崎岖陡峭的山路上跑步前进，一昼夜奔袭竟达120公里，终于在5月29日凌晨6时许按时到达泸定桥西岸。第2连连长和22名突击队员沿着枪林弹雨和火墙密布的铁索踩着铁链夺下桥头，并与左岸部队合围占领了泸定桥。'
        }, {
          xy: [103.929266, 34.139361],
          name: '腊子口战役',
          ico: 'lazikou.jpg',
          info: '1935年9月16日，中国工农红军陕甘支队抵达甘肃南部的天险关隘腊子口。国民党军鲁大昌部3个团据险阻击红军前进。当天，红军正面强攻，未能突破国民党军防御阵地。17日，红军两个连翻越悬崖陡壁，穿插国民党军侧背，一举将守敌击溃。天险腊子口突破后，中央红军进入甘南开阔地带，北上陕甘地区的通道开辟出来了。'
        },



    ]
}
export default pointdata